app/Models/UserModel.php

    public function findByEmail(string $email): ?array
    {
        return $this->where('email', strtolower(trim($email)))->first();
---
SELECT *
FROM "users"
WHERE "email" = 'admin@hris.test'
 LIMIT 1